theatrus/ksdk/platform/devices/MKV40F15/include/MKV40F15_features.h
    /* @brief Has FTM3 channel 0 input capture source selection (register bit SOPT4[FTM3CH0SRC]). */
    #define FSL_FEATURE_SIM_OPT_HAS_FTM3_CHANNELS (0)
    /* @brief Has FTM2 channel 1 input capture source selection (register bit SOPT4[FTM2CH1SRC]). */
    #define FSL_FEATURE_SIM_OPT_HAS_FTM2_CHANNEL1 (0)
    /* @brief Number of configurable FTM0 fault detection input (number of register bits SOPT4[FTM0FLTn], where n is a number starting from zero). */
    #define FSL_FEATURE_SIM_OPT_FTM0_FAULT_COUNT (4)
    /* @brief Number of configurable FTM1 fault detection input (number of register bits SOPT4[FTM1FLTn], where n is a number starting from zero). */
    #define FSL_FEATURE_SIM_OPT_FTM1_FAULT_COUNT (1)
    /* @brief Number of configurable FTM2 fault detection input (number of register bits SOPT4[FTM2FLTn], where n is a number starting from zero). */
    #define FSL_FEATURE_SIM_OPT_FTM2_FAULT_COUNT (0)
    /* @brief Number of configurable FTM3 fault detection input (number of register bits SOPT4[FTM3FLTn], where n is a number starting from zero). */
    #define FSL_FEATURE_SIM_OPT_FTM3_FAULT_COUNT (1)
    /* @brief Has FTM hardware trigger 0 software synchronization (register bit SOPT8[FTMnSYNCBIT], where n is a module instance index). */
    #define FSL_FEATURE_SIM_OPT_HAS_FTM_TRIGGER_SYNC (1)
    /* @brief Has FTM channels output source selection (register bit SOPT8[FTMxOCHnSRC], where x is a module instance index and n is a channel index). */
    #define FSL_FEATURE_SIM_OPT_HAS_FTM_CHANNELS_OUTPUT_SRC (1)
    /* @brief Has TPM module(s) configuration. */
    #define FSL_FEATURE_SIM_OPT_HAS_TPM (0)
    /* @brief The highest TPM module index. */
    #define FSL_FEATURE_SIM_OPT_MAX_TPM_INDEX (0)
    /* @brief Has TPM module with index 0. */
    #define FSL_FEATURE_SIM_OPT_HAS_TPM0 (0)
    /* @brief Has TPM0 clock selection (register bit field SOPT4[TPM0CLKSEL]). */
    #define FSL_FEATURE_SIM_OPT_HAS_TPM0_CLK_SEL (0)
    /* @brief Is TPM channels configuration in the SOPT4 (not SOPT9) register (register bits TPMnCH0SRC, TPMnCLKSEL, where n is a module instance index). */
    #define FSL_FEATURE_SIM_OPT_HAS_TPM_CHANNELS_CONFIG_IN_SOPT4_REG (0)
    /* @brief Has TPM1 channel 0 input capture source selection (register bit field SOPT4[TPM1CH0SRC] or SOPT9[TPM1CH0SRC]). */
    #define FSL_FEATURE_SIM_OPT_HAS_TPM1_CH0_SRC_SELECTION (0)
    /* @brief Has TPM1 clock selection (register bit field SOPT4[TPM1CLKSEL]). */
    #define FSL_FEATURE_SIM_OPT_HAS_TPM1_CLK_SEL (0)
    /* @brief TPM1 channel 0 input capture source selection width (width of register bit field SOPT4[TPM1CH0SRC] or SOPT9[TPM1CH0SRC]). */
    #define FSL_FEATURE_SIM_OPT_TPM1_CH0_SRC_SELECTION_WIDTH (0)
    /* @brief Has TPM2 channel 0 input capture source selection (register bit field SOPT4[TPM2CH0SRC]). */
    #define FSL_FEATURE_SIM_OPT_HAS_TPM2_CH0_SRC_SELECTION (0)
    /* @brief Has TPM2 clock selection (register bit field SOPT4[TPM2CLKSEL]). */
    #define FSL_FEATURE_SIM_OPT_HAS_TPM2_CLK_SEL (0)
    /* @brief Has PLL/FLL clock selection (register bit field SOPT2[PLLFLLSEL]). */
    #define FSL_FEATURE_SIM_OPT_HAS_PLL_FLL_SELECTION (0)
    /* @brief PLL/FLL clock selection width (width of register bit field SOPT2[PLLFLLSEL]). */
    #define FSL_FEATURE_SIM_OPT_PLL_FLL_SELECTION_WIDTH (0)
    /* @brief Has NFC clock source selection (register bit SOPT2[NFCSRC]). */
    #define FSL_FEATURE_SIM_OPT_HAS_NFCSRC (0)
    /* @brief Has eSDHC clock source selection (register bit SOPT2[ESDHCSRC]). */
    #define FSL_FEATURE_SIM_OPT_HAS_ESDHCSRC (0)
    /* @brief Has SDHC clock source selection (register bit SOPT2[SDHCSRC]). */
    #define FSL_FEATURE_SIM_OPT_HAS_SDHCSRC (0)
    /* @brief Has LCDC clock source selection (register bits SOPT2[LCDCSRC], SOPT2[LCDC_CLKSEL]). */
    #define FSL_FEATURE_SIM_OPT_HAS_LCDCSRC (0)
    /* @brief Has ENET timestamp clock source selection (register bit SOPT2[TIMESRC]). */
    #define FSL_FEATURE_SIM_OPT_HAS_TIMESRC (0)
    /* @brief Has ENET RMII clock source selection (register bit SOPT2[RMIISRC]). */
    #define FSL_FEATURE_SIM_OPT_HAS_RMIISRC (0)
    /* @brief Has USB clock source selection (register bit SOPT2[USBSRC]). */
    #define FSL_FEATURE_SIM_OPT_HAS_USBSRC (0)
    /* @brief Has USB FS clock source selection (register bit SOPT2[USBFSRC]). */
    #define FSL_FEATURE_SIM_OPT_HAS_USBFSRC (0)
    /* @brief Has USB HS clock source selection (register bit SOPT2[USBHSRC]). */
    #define FSL_FEATURE_SIM_OPT_HAS_USBHSRC (0)
    /* @brief Has LPUART clock source selection (register bit SOPT2[LPUARTSRC]). */
    #define FSL_FEATURE_SIM_OPT_HAS_LPUARTSRC (0)
    /* @brief Has LPUART0 clock source selection (register bit SOPT2[LPUART0SRC]). */
    #define FSL_FEATURE_SIM_OPT_HAS_LPUART0SRC (0)
    /* @brief Has LPUART1 clock source selection (register bit SOPT2[LPUART1SRC]). */
    #define FSL_FEATURE_SIM_OPT_HAS_LPUART1SRC (0)
    /* @brief Has FLEXIOSRC clock source selection (register bit SOPT2[FLEXIOSRC]). */
    #define FSL_FEATURE_SIM_OPT_HAS_FLEXIOSRC (0)
    /* @brief Has UART0 clock source selection (register bit SOPT2[UART0SRC]). */
    #define FSL_FEATURE_SIM_OPT_HAS_UART0SRC (0)
    /* @brief Has TPM clock source selection (register bit SOPT2[TPMSRC]). */
    #define FSL_FEATURE_SIM_OPT_HAS_TPMSRC (0)
    /* @brief Has debug trace clock selection (register bit SOPT2[TRACECLKSEL]). */
    #define FSL_FEATURE_SIM_OPT_HAS_TRACE_CLKSEL (1)
    /* @brief Number of ADC modules (register bits SOPT7[ADCnTRGSEL], SOPT7[ADCnPRETRGSEL], SOPT7[ADCnALTTRGSEL], where n is a module instance index). */
    #define FSL_FEATURE_SIM_OPT_ADC_COUNT (1)
    /* @brief Has clock 2 output divider (register bit field CLKDIV1[OUTDIV2]). */
    #define FSL_FEATURE_SIM_DIVIDER_HAS_OUTDIV2 (1)
    /* @brief Has clock 3 output divider (register bit field CLKDIV1[OUTDIV3]). */
    #define FSL_FEATURE_SIM_DIVIDER_HAS_OUTDIV3 (0)
    /* @brief Has clock 4 output divider (register bit field CLKDIV1[OUTDIV4]). */
    #define FSL_FEATURE_SIM_DIVIDER_HAS_OUTDIV4 (1)
    /* @brief Clock 4 output divider width (width of register bit field CLKDIV1[OUTDIV4]). */
    #define FSL_FEATURE_SIM_DIVIDER_OUTDIV4_WIDTH (4)
    /* @brief Has clock 5 output divider (register bit field CLKDIV1[OUTDIV5]). */
    #define FSL_FEATURE_SIM_DIVIDER_HAS_OUTDIV5 (0)
    /* @brief Has USB clock divider (register bit field CLKDIV2[USBDIV] and CLKDIV2[USBFRAC]). */
    #define FSL_FEATURE_SIM_DIVIDER_HAS_USBDIV (0)
    /* @brief Has USB FS clock divider (register bit field CLKDIV2[USBFSDIV] and CLKDIV2[USBFSFRAC]). */
    #define FSL_FEATURE_SIM_DIVIDER_HAS_USBFSDIV (0)
    /* @brief Has USB HS clock divider (register bit field CLKDIV2[USBHSDIV] and CLKDIV2[USBHSFRAC]). */
    #define FSL_FEATURE_SIM_DIVIDER_HAS_USBHSDIV (0)
    /* @brief Has PLL/FLL clock divider (register bit field CLKDIV3[PLLFLLDIV] and CLKDIV3[PLLFLLFRAC]). */
    #define FSL_FEATURE_SIM_DIVIDER_HAS_PLLFLLDIV (0)
    /* @brief Has LCDC clock divider (register bit field CLKDIV3[LCDCDIV] and CLKDIV3[LCDCFRAC]). */
    #define FSL_FEATURE_SIM_DIVIDER_HAS_LCDCDIV (0)
    /* @brief Has trace clock divider (register bit field CLKDIV4[TRACEDIV] and CLKDIV4[TRACEFRAC]). */
    #define FSL_FEATURE_SIM_DIVIDER_HAS_TRACEDIV (1)
    /* @brief Has NFC clock divider (register bit field CLKDIV4[NFCDIV] and CLKDIV4[NFCFRAC]). */
    #define FSL_FEATURE_SIM_DIVIDER_HAS_NFCDIV (0)
    /* @brief Has Kinetis family ID (register bit field SDID[FAMILYID]). */
    #define FSL_FEATURE_SIM_SDID_HAS_FAMILYID (1)
    /* @brief Has Kinetis family ID (register bit field SDID[FAMID]). */
    #define FSL_FEATURE_SIM_SDID_HAS_FAMID (0)
    /* @brief Has Kinetis sub-family ID (register bit field SDID[SUBFAMID]). */
    #define FSL_FEATURE_SIM_SDID_HAS_SUBFAMID (1)
    /* @brief Has Kinetis series ID (register bit field SDID[SERIESID]). */
    #define FSL_FEATURE_SIM_SDID_HAS_SERIESID (1)
    /* @brief Has device die ID (register bit field SDID[DIEID]). */
    #define FSL_FEATURE_SIM_SDID_HAS_DIEID (1)
    /* @brief Has system SRAM size specifier (register bit field SDID[SRAMSIZE]). */
    #define FSL_FEATURE_SIM_SDID_HAS_SRAMSIZE (0)
    /* @brief Has flash mode (register bit FCFG1[FLASHDOZE]). */
    #define FSL_FEATURE_SIM_FCFG_HAS_FLASHDOZE (1)
    /* @brief Has flash disable (register bit FCFG1[FLASHDIS]). */
    #define FSL_FEATURE_SIM_FCFG_HAS_FLASHDIS (1)
    /* @brief Has FTFE disable (register bit FCFG1[FTFDIS]). */
    #define FSL_FEATURE_SIM_FCFG_HAS_FTFDIS (0)
    /* @brief Has FlexNVM size specifier (register bit field FCFG1[NVMSIZE]). */
    #define FSL_FEATURE_SIM_FCFG_HAS_NVMSIZE (0)
    /* @brief Has EEPROM size specifier (register bit field FCFG1[EESIZE]). */
    #define FSL_FEATURE_SIM_FCFG_HAS_EESIZE (0)
    /* @brief Has FlexNVM partition (register bit field FCFG1[DEPART]). */
    #define FSL_FEATURE_SIM_FCFG_HAS_DEPART (0)
    /* @brief Maximum flash address block 0 address specifier (register bit field FCFG2[MAXADDR0]). */
    #define FSL_FEATURE_SIM_FCFG_HAS_MAXADDR0 (1)
    /* @brief Maximum flash address block 1 address specifier (register bit field FCFG2[MAXADDR1]). */
    #define FSL_FEATURE_SIM_FCFG_HAS_MAXADDR1 (0)
    /* @brief Maximum flash address block 0 or 1 address specifier (register bit field FCFG2[MAXADDR01]). */
    #define FSL_FEATURE_SIM_FCFG_HAS_MAXADDR01 (0)
    /* @brief Maximum flash address block 2 or 3 address specifier (register bit field FCFG2[MAXADDR23]). */
    #define FSL_FEATURE_SIM_FCFG_HAS_MAXADDR23 (0)
    /* @brief Has program flash availability specifier (register bit FCFG2[PFLSH]). */
    #define FSL_FEATURE_SIM_FCFG_HAS_PFLSH (0)
    /* @brief Has program flash swapping (register bit FCFG2[SWAPPFLSH]). */
    #define FSL_FEATURE_SIM_FCFG_HAS_PFLSH_SWAP (0)
    /* @brief Has miscellanious control register (register MCR). */
    #define FSL_FEATURE_SIM_HAS_MISC_CONTROLS (0)
    /* @brief Has COP watchdog (registers COPC and SRVCOP). */
    #define FSL_FEATURE_SIM_HAS_COP_WATCHDOG (0)
    /* @brief Has COP watchdog stop (register bits COPC[COPSTPEN], COPC[COPDBGEN] and COPC[COPCLKSEL]). */
    #define FSL_FEATURE_SIM_HAS_COP_STOP (0)
    /* @brief Has LLWU clock gate bit (e.g SIM_SCGC4). */
    #define FSL_FEATURE_SIM_HAS_SCGC_LLWU (0)
#endif

/* SMC module features */

