theatrus/ksdk/platform/devices/MKV40F15/include/MKV40F15_features.h
#if defined(CPU_MKV40F128VLH15) || defined(CPU_MKV40F256VLH15) || defined(CPU_MKV40F64VLH15)
    /* @brief Has single XBAR module. */
    #define FSL_FEATURE_XBARB_HAS_SINGLE_MODULE (0)
    /* @brief Maximum value of XBARB input. */
    #define FSL_FEATURE_XBARB_MODULE_INPUTS (27)
    /* @brief Maximum value of XBARB output. */
    #define FSL_FEATURE_XBARB_MODULE_OUTPUTS (16)
    /* @brief Half register position. */
    #define FSL_FEATURE_XBARB_HALF_REGISTER_SHIFT (BP_XBARB_SEL0_SEL1)
    /* @brief Number of interrupt requests. */
    #define FSL_FEATURE_XBARB_INTERRUPT_COUNT (0)
    /* @brief XBARB has input 0. */
    #define FSL_FEATURE_XBARB_HAS_INPUT0 (1)
    /* @brief XBARB has input 1. */
    #define FSL_FEATURE_XBARB_HAS_INPUT1 (1)
    /* @brief XBARB has input 2. */
    #define FSL_FEATURE_XBARB_HAS_INPUT2 (1)
    /* @brief XBARB has input 3. */
    #define FSL_FEATURE_XBARB_HAS_INPUT3 (1)
    /* @brief XBARB has input 4. */
    #define FSL_FEATURE_XBARB_HAS_INPUT4 (1)
    /* @brief XBARB has input 5. */
    #define FSL_FEATURE_XBARB_HAS_INPUT5 (1)
    /* @brief XBARB has input 6. */
    #define FSL_FEATURE_XBARB_HAS_INPUT6 (0)
    /* @brief XBARB has input 7. */
    #define FSL_FEATURE_XBARB_HAS_INPUT7 (0)
    /* @brief XBARB has input 8. */
    #define FSL_FEATURE_XBARB_HAS_INPUT8 (0)
    /* @brief XBARB has input 9. */
    #define FSL_FEATURE_XBARB_HAS_INPUT9 (0)
    /* @brief XBARB has input 10. */
    #define FSL_FEATURE_XBARB_HAS_INPUT10 (0)
    /* @brief XBARB has input 11. */
    #define FSL_FEATURE_XBARB_HAS_INPUT11 (0)
    /* @brief XBARB has input 12. */
    #define FSL_FEATURE_XBARB_HAS_INPUT12 (1)
    /* @brief XBARB has input 13. */
    #define FSL_FEATURE_XBARB_HAS_INPUT13 (1)
    /* @brief XBARB has input 14. */
    #define FSL_FEATURE_XBARB_HAS_INPUT14 (1)
    /* @brief XBARB has input 15. */
    #define FSL_FEATURE_XBARB_HAS_INPUT15 (1)
    /* @brief XBARB has input 16. */
    #define FSL_FEATURE_XBARB_HAS_INPUT16 (1)
    /* @brief XBARB has input 17. */
    #define FSL_FEATURE_XBARB_HAS_INPUT17 (1)
    /* @brief XBARB has input 18. */
    #define FSL_FEATURE_XBARB_HAS_INPUT18 (1)
    /* @brief XBARB has input 19. */
    #define FSL_FEATURE_XBARB_HAS_INPUT19 (1)
    /* @brief XBARB has input 20. */
    #define FSL_FEATURE_XBARB_HAS_INPUT20 (1)
    /* @brief XBARB has input 21. */
    #define FSL_FEATURE_XBARB_HAS_INPUT21 (1)
    /* @brief XBARB has input 22. */
    #define FSL_FEATURE_XBARB_HAS_INPUT22 (1)
    /* @brief XBARB has input 23. */
    #define FSL_FEATURE_XBARB_HAS_INPUT23 (1)
    /* @brief XBARB has input 24. */
    #define FSL_FEATURE_XBARB_HAS_INPUT24 (1)
    /* @brief XBARB has input 25. */
    #define FSL_FEATURE_XBARB_HAS_INPUT25 (1)
    /* @brief XBARB has input 26. */
    #define FSL_FEATURE_XBARB_HAS_INPUT26 (1)
    /* @brief XBARB has input 27. */
    #define FSL_FEATURE_XBARB_HAS_INPUT27 (1)
    /* @brief XBARB has input 28. */
    #define FSL_FEATURE_XBARB_HAS_INPUT28 (0)
    /* @brief XBARB has input 29. */
    #define FSL_FEATURE_XBARB_HAS_INPUT29 (0)
    /* @brief XBARB has input 30. */
    #define FSL_FEATURE_XBARB_HAS_INPUT30 (0)
    /* @brief XBARB has input 31. */
    #define FSL_FEATURE_XBARB_HAS_INPUT31 (0)
    /* @brief XBARB has input 32. */
    #define FSL_FEATURE_XBARB_HAS_INPUT32 (0)
    /* @brief XBARB has input 33. */
    #define FSL_FEATURE_XBARB_HAS_INPUT33 (0)
    /* @brief XBARB has input 34. */
    #define FSL_FEATURE_XBARB_HAS_INPUT34 (0)
    /* @brief XBARB has input 35. */
    #define FSL_FEATURE_XBARB_HAS_INPUT35 (0)
    /* @brief XBARB has input 36. */
    #define FSL_FEATURE_XBARB_HAS_INPUT36 (0)
    /* @brief XBARB has input 37. */
    #define FSL_FEATURE_XBARB_HAS_INPUT37 (0)
    /* @brief XBARB has input 38. */
    #define FSL_FEATURE_XBARB_HAS_INPUT38 (0)
    /* @brief XBARB has input 39. */
    #define FSL_FEATURE_XBARB_HAS_INPUT39 (0)
    /* @brief XBARB has input 40. */
    #define FSL_FEATURE_XBARB_HAS_INPUT40 (0)
    /* @brief XBARB has input 41. */
    #define FSL_FEATURE_XBARB_HAS_INPUT41 (0)
    /* @brief XBARB has input 42. */
    #define FSL_FEATURE_XBARB_HAS_INPUT42 (0)
    /* @brief XBARB has input 43. */
    #define FSL_FEATURE_XBARB_HAS_INPUT43 (0)
    /* @brief XBARB has input 44. */
    #define FSL_FEATURE_XBARB_HAS_INPUT44 (0)
    /* @brief XBARB has input 45. */
    #define FSL_FEATURE_XBARB_HAS_INPUT45 (0)
    /* @brief XBARB has input 46. */
    #define FSL_FEATURE_XBARB_HAS_INPUT46 (0)
    /* @brief XBARB has input 47. */
    #define FSL_FEATURE_XBARB_HAS_INPUT47 (0)
    /* @brief XBARB has input 48. */
    #define FSL_FEATURE_XBARB_HAS_INPUT48 (0)
    /* @brief XBARB has input 49. */
    #define FSL_FEATURE_XBARB_HAS_INPUT49 (0)
    /* @brief XBARB has input 50. */
    #define FSL_FEATURE_XBARB_HAS_INPUT50 (0)
    /* @brief XBARB has input 51. */
    #define FSL_FEATURE_XBARB_HAS_INPUT51 (0)
    /* @brief XBARB has input 52. */
    #define FSL_FEATURE_XBARB_HAS_INPUT52 (0)
    /* @brief XBARB has input 53. */
    #define FSL_FEATURE_XBARB_HAS_INPUT53 (0)
    /* @brief XBARB has input 54. */
    #define FSL_FEATURE_XBARB_HAS_INPUT54 (0)
    /* @brief XBARB has input 55. */
    #define FSL_FEATURE_XBARB_HAS_INPUT55 (0)
    /* @brief XBARB has input 56. */
    #define FSL_FEATURE_XBARB_HAS_INPUT56 (0)
    /* @brief XBARB has input 57. */
    #define FSL_FEATURE_XBARB_HAS_INPUT57 (0)
    /* @brief XBARB has input 58. */
    #define FSL_FEATURE_XBARB_HAS_INPUT58 (0)
    /* @brief XBARB has input 59. */
    #define FSL_FEATURE_XBARB_HAS_INPUT59 (0)
    /* @brief XBARB has input 60. */
    #define FSL_FEATURE_XBARB_HAS_INPUT60 (0)
    /* @brief XBARB has input 61. */
    #define FSL_FEATURE_XBARB_HAS_INPUT61 (0)
    /* @brief XBARB has input 62. */
    #define FSL_FEATURE_XBARB_HAS_INPUT62 (0)
    /* @brief XBARB has input 63. */
    #define FSL_FEATURE_XBARB_HAS_INPUT63 (0)
    /* @brief XBARB has input 64. */
    #define FSL_FEATURE_XBARB_HAS_INPUT64 (0)
    /* @brief XBARB has input 65. */
    #define FSL_FEATURE_XBARB_HAS_INPUT65 (0)
    /* @brief XBARB has input 66. */
    #define FSL_FEATURE_XBARB_HAS_INPUT66 (0)
    /* @brief XBARB has input 67. */
    #define FSL_FEATURE_XBARB_HAS_INPUT67 (0)
    /* @brief XBARB has input 68. */
    #define FSL_FEATURE_XBARB_HAS_INPUT68 (0)
    /* @brief XBARB has input 69. */
    #define FSL_FEATURE_XBARB_HAS_INPUT69 (0)
    /* @brief XBARB has input 70. */
    #define FSL_FEATURE_XBARB_HAS_INPUT70 (0)
    /* @brief XBARB has input 71. */
    #define FSL_FEATURE_XBARB_HAS_INPUT71 (0)
    /* @brief XBARB has input 72. */
    #define FSL_FEATURE_XBARB_HAS_INPUT72 (0)
    /* @brief XBARB has input 73. */
    #define FSL_FEATURE_XBARB_HAS_INPUT73 (0)
    /* @brief XBARB has input 74. */
    #define FSL_FEATURE_XBARB_HAS_INPUT74 (0)
    /* @brief XBARB has input 75. */
    #define FSL_FEATURE_XBARB_HAS_INPUT75 (0)
    /* @brief XBARB has input 76. */
    #define FSL_FEATURE_XBARB_HAS_INPUT76 (0)
    /* @brief XBARB has input 77. */
    #define FSL_FEATURE_XBARB_HAS_INPUT77 (0)
    /* @brief XBARB has input 78. */
    #define FSL_FEATURE_XBARB_HAS_INPUT78 (0)
    /* @brief XBARB has input 79. */
    #define FSL_FEATURE_XBARB_HAS_INPUT79 (0)
    /* @brief XBARB has input 80. */
    #define FSL_FEATURE_XBARB_HAS_INPUT80 (0)
    /* @brief XBARB has input 81. */
    #define FSL_FEATURE_XBARB_HAS_INPUT81 (0)
    /* @brief XBARB has input 82. */
    #define FSL_FEATURE_XBARB_HAS_INPUT82 (0)
    /* @brief XBARB has input 83. */
    #define FSL_FEATURE_XBARB_HAS_INPUT83 (0)
    /* @brief XBARB has input 84. */
    #define FSL_FEATURE_XBARB_HAS_INPUT84 (0)
    /* @brief XBARB has input 85. */
    #define FSL_FEATURE_XBARB_HAS_INPUT85 (0)
    /* @brief XBARB has input 86. */
    #define FSL_FEATURE_XBARB_HAS_INPUT86 (0)
    /* @brief XBARB has input 87. */
    #define FSL_FEATURE_XBARB_HAS_INPUT87 (0)
    /* @brief XBARB has input 88. */
    #define FSL_FEATURE_XBARB_HAS_INPUT88 (0)
    /* @brief XBARB has input 89. */
    #define FSL_FEATURE_XBARB_HAS_INPUT89 (0)
    /* @brief XBARB has input 90. */
    #define FSL_FEATURE_XBARB_HAS_INPUT90 (0)
    /* @brief XBARB has input 91. */
    #define FSL_FEATURE_XBARB_HAS_INPUT91 (0)
    /* @brief XBARB has input 92. */
    #define FSL_FEATURE_XBARB_HAS_INPUT92 (0)
    /* @brief XBARB has input 93. */
    #define FSL_FEATURE_XBARB_HAS_INPUT93 (0)
    /* @brief XBARB has input 94. */
    #define FSL_FEATURE_XBARB_HAS_INPUT94 (0)
    /* @brief XBARB has input 95. */
    #define FSL_FEATURE_XBARB_HAS_INPUT95 (0)
    /* @brief XBARB has input 96. */
    #define FSL_FEATURE_XBARB_HAS_INPUT96 (0)
    /* @brief XBARB has input 97. */
    #define FSL_FEATURE_XBARB_HAS_INPUT97 (0)
    /* @brief XBARB has input 98. */
    #define FSL_FEATURE_XBARB_HAS_INPUT98 (0)
    /* @brief XBARB has input 99. */
    #define FSL_FEATURE_XBARB_HAS_INPUT99 (0)
    /* @brief XBARB has input 100. */
    #define FSL_FEATURE_XBARB_HAS_INPUT100 (0)
    /* @brief XBARB has input 101. */
    #define FSL_FEATURE_XBARB_HAS_INPUT101 (0)
    /* @brief XBARB has input 102. */
    #define FSL_FEATURE_XBARB_HAS_INPUT102 (0)
    /* @brief XBARB has input 103. */
    #define FSL_FEATURE_XBARB_HAS_INPUT103 (0)
    /* @brief XBARB has input 104. */
    #define FSL_FEATURE_XBARB_HAS_INPUT104 (0)
    /* @brief XBARB has input 105. */
    #define FSL_FEATURE_XBARB_HAS_INPUT105 (0)
    /* @brief XBARB has input 106. */
    #define FSL_FEATURE_XBARB_HAS_INPUT106 (0)
    /* @brief XBARB has input 107. */
    #define FSL_FEATURE_XBARB_HAS_INPUT107 (0)
    /* @brief XBARB has input 108. */
    #define FSL_FEATURE_XBARB_HAS_INPUT108 (0)
    /* @brief XBARB has input 109. */
    #define FSL_FEATURE_XBARB_HAS_INPUT109 (0)
    /* @brief XBARB has input 110. */
    #define FSL_FEATURE_XBARB_HAS_INPUT110 (0)
    /* @brief XBARB has input 111. */
    #define FSL_FEATURE_XBARB_HAS_INPUT111 (0)
    /* @brief XBARB has input 112. */
    #define FSL_FEATURE_XBARB_HAS_INPUT112 (0)
    /* @brief XBARB has input 113. */
    #define FSL_FEATURE_XBARB_HAS_INPUT113 (0)
    /* @brief XBARB has input 114. */
    #define FSL_FEATURE_XBARB_HAS_INPUT114 (0)
    /* @brief XBARB has input 115. */
    #define FSL_FEATURE_XBARB_HAS_INPUT115 (0)
    /* @brief XBARB has input 116. */
    #define FSL_FEATURE_XBARB_HAS_INPUT116 (0)
    /* @brief XBARB has input 117. */
    #define FSL_FEATURE_XBARB_HAS_INPUT117 (0)
    /* @brief XBARB has input 118. */
    #define FSL_FEATURE_XBARB_HAS_INPUT118 (0)
    /* @brief XBARB has input 119. */
    #define FSL_FEATURE_XBARB_HAS_INPUT119 (0)
    /* @brief XBARB has input 120. */
    #define FSL_FEATURE_XBARB_HAS_INPUT120 (0)
    /* @brief XBARB has input 121. */
    #define FSL_FEATURE_XBARB_HAS_INPUT121 (0)
    /* @brief XBARB has input 122. */
    #define FSL_FEATURE_XBARB_HAS_INPUT122 (0)
    /* @brief XBARB has input 123. */
    #define FSL_FEATURE_XBARB_HAS_INPUT123 (0)
    /* @brief XBARB has input 124. */
    #define FSL_FEATURE_XBARB_HAS_INPUT124 (0)
    /* @brief XBARB has input 125. */
    #define FSL_FEATURE_XBARB_HAS_INPUT125 (0)
    /* @brief XBARB has input 126. */
    #define FSL_FEATURE_XBARB_HAS_INPUT126 (0)
    /* @brief XBARB has input 127. */
    #define FSL_FEATURE_XBARB_HAS_INPUT127 (0)
    /* @brief XBARB has output 0. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT0 (1)
    /* @brief XBARB has output 1. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT1 (1)
    /* @brief XBARB has output 2. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT2 (1)
    /* @brief XBARB has output 3. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT3 (1)
    /* @brief XBARB has output 4. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT4 (1)
    /* @brief XBARB has output 5. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT5 (1)
    /* @brief XBARB has output 6. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT6 (1)
    /* @brief XBARB has output 7. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT7 (1)
    /* @brief XBARB has output 8. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT8 (1)
    /* @brief XBARB has output 9. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT9 (1)
    /* @brief XBARB has output 10. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT10 (1)
    /* @brief XBARB has output 11. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT11 (1)
    /* @brief XBARB has output 12. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT12 (1)
    /* @brief XBARB has output 13. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT13 (1)
    /* @brief XBARB has output 14. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT14 (1)
    /* @brief XBARB has output 15. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT15 (1)
    /* @brief XBARB has output 16. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT16 (0)
    /* @brief XBARB has output 17. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT17 (0)
    /* @brief XBARB has output 18. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT18 (0)
    /* @brief XBARB has output 19. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT19 (0)
    /* @brief XBARB has output 20. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT20 (0)
    /* @brief XBARB has output 21. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT21 (0)
    /* @brief XBARB has output 22. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT22 (0)
    /* @brief XBARB has output 23. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT23 (0)
    /* @brief XBARB has output 24. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT24 (0)
    /* @brief XBARB has output 25. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT25 (0)
    /* @brief XBARB has output 26. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT26 (0)
    /* @brief XBARB has output 27. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT27 (0)
    /* @brief XBARB has output 28. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT28 (0)
    /* @brief XBARB has output 29. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT29 (0)
    /* @brief XBARB has output 30. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT30 (0)
    /* @brief XBARB has output 31. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT31 (0)
    /* @brief XBARB has output 32. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT32 (0)
    /* @brief XBARB has output 33. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT33 (0)
    /* @brief XBARB has output 34. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT34 (0)
    /* @brief XBARB has output 35. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT35 (0)
    /* @brief XBARB has output 36. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT36 (0)
    /* @brief XBARB has output 37. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT37 (0)
    /* @brief XBARB has output 38. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT38 (0)
    /* @brief XBARB has output 39. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT39 (0)
    /* @brief XBARB has output 40. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT40 (0)
    /* @brief XBARB has output 41. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT41 (0)
    /* @brief XBARB has output 42. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT42 (0)
    /* @brief XBARB has output 43. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT43 (0)
    /* @brief XBARB has output 44. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT44 (0)
    /* @brief XBARB has output 45. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT45 (0)
    /* @brief XBARB has output 46. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT46 (0)
    /* @brief XBARB has output 47. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT47 (0)
    /* @brief XBARB has output 48. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT48 (0)
    /* @brief XBARB has output 49. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT49 (0)
    /* @brief XBARB has output 50. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT50 (0)
    /* @brief XBARB has output 51. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT51 (0)
    /* @brief XBARB has output 52. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT52 (0)
    /* @brief XBARB has output 53. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT53 (0)
    /* @brief XBARB has output 54. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT54 (0)
    /* @brief XBARB has output 55. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT55 (0)
    /* @brief XBARB has output 56. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT56 (0)
    /* @brief XBARB has output 57. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT57 (0)
    /* @brief XBARB has output 58. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT58 (0)
    /* @brief XBARB has output 59. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT59 (0)
    /* @brief XBARB has output 60. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT60 (0)
    /* @brief XBARB has output 61. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT61 (0)
    /* @brief XBARB has output 62. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT62 (0)
    /* @brief XBARB has output 63. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT63 (0)
    /* @brief XBARB has output 64. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT64 (0)
    /* @brief XBARB has output 65. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT65 (0)
    /* @brief XBARB has output 66. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT66 (0)
    /* @brief XBARB has output 67. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT67 (0)
    /* @brief XBARB has output 68. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT68 (0)
    /* @brief XBARB has output 69. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT69 (0)
    /* @brief XBARB has output 70. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT70 (0)
    /* @brief XBARB has output 71. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT71 (0)
    /* @brief XBARB has output 72. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT72 (0)
    /* @brief XBARB has output 73. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT73 (0)
    /* @brief XBARB has output 74. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT74 (0)
    /* @brief XBARB has output 75. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT75 (0)
    /* @brief XBARB has output 76. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT76 (0)
    /* @brief XBARB has output 77. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT77 (0)
    /* @brief XBARB has output 78. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT78 (0)
    /* @brief XBARB has output 79. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT79 (0)
    /* @brief XBARB has output 80. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT80 (0)
    /* @brief XBARB has output 81. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT81 (0)
    /* @brief XBARB has output 82. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT82 (0)
    /* @brief XBARB has output 83. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT83 (0)
    /* @brief XBARB has output 84. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT84 (0)
    /* @brief XBARB has output 85. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT85 (0)
    /* @brief XBARB has output 86. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT86 (0)
    /* @brief XBARB has output 87. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT87 (0)
    /* @brief XBARB has output 88. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT88 (0)
    /* @brief XBARB has output 89. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT89 (0)
    /* @brief XBARB has output 90. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT90 (0)
    /* @brief XBARB has output 91. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT91 (0)
    /* @brief XBARB has output 92. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT92 (0)
    /* @brief XBARB has output 93. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT93 (0)
    /* @brief XBARB has output 94. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT94 (0)
    /* @brief XBARB has output 95. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT95 (0)
    /* @brief XBARB has output 96. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT96 (0)
    /* @brief XBARB has output 97. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT97 (0)
    /* @brief XBARB has output 98. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT98 (0)
    /* @brief XBARB has output 99. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT99 (0)
    /* @brief XBARB has output 100. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT100 (0)
    /* @brief XBARB has output 101. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT101 (0)
    /* @brief XBARB has output 102. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT102 (0)
    /* @brief XBARB has output 103. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT103 (0)
    /* @brief XBARB has output 104. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT104 (0)
    /* @brief XBARB has output 105. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT105 (0)
    /* @brief XBARB has output 106. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT106 (0)
    /* @brief XBARB has output 107. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT107 (0)
    /* @brief XBARB has output 108. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT108 (0)
    /* @brief XBARB has output 109. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT109 (0)
    /* @brief XBARB has output 110. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT110 (0)
    /* @brief XBARB has output 111. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT111 (0)
    /* @brief XBARB has output 112. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT112 (0)
    /* @brief XBARB has output 113. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT113 (0)
    /* @brief XBARB has output 114. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT114 (0)
    /* @brief XBARB has output 115. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT115 (0)
    /* @brief XBARB has output 116. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT116 (0)
    /* @brief XBARB has output 117. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT117 (0)
    /* @brief XBARB has output 118. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT118 (0)
    /* @brief XBARB has output 119. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT119 (0)
    /* @brief XBARB has output 120. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT120 (0)
    /* @brief XBARB has output 121. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT121 (0)
    /* @brief XBARB has output 122. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT122 (0)
    /* @brief XBARB has output 123. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT123 (0)
    /* @brief XBARB has output 124. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT124 (0)
    /* @brief XBARB has output 125. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT125 (0)
    /* @brief XBARB has output 126. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT126 (0)
    /* @brief XBARB has output 127. */
    #define FSL_FEATURE_XBARB_HAS_OUTPUT127 (0)
    /* @brief XBARB input 0 ID. */
    #define FSL_FEATURE_XBARB_INPUT0_ID (CMP0_output)
    /* @brief XBARB input 1 ID. */
    #define FSL_FEATURE_XBARB_INPUT1_ID (CMP1_output)
    /* @brief XBARB input 2 ID. */
    #define FSL_FEATURE_XBARB_INPUT2_ID (CMP2_output)
    /* @brief XBARB input 3 ID. */
    #define FSL_FEATURE_XBARB_INPUT3_ID (CMP3_output)
    /* @brief XBARB input 4 ID. */
    #define FSL_FEATURE_XBARB_INPUT4_ID (FTM0_match)
    /* @brief XBARB input 5 ID. */
    #define FSL_FEATURE_XBARB_INPUT5_ID (FTM0_EXTRIG)
    /* @brief XBARB input 6 ID. */
    #define FSL_FEATURE_XBARB_INPUT6_ID (XBARB_IN_RESERVED6)
    /* @brief XBARB input 7 ID. */
    #define FSL_FEATURE_XBARB_INPUT7_ID (XBARB_IN_RESERVED7)
    /* @brief XBARB input 8 ID. */
    #define FSL_FEATURE_XBARB_INPUT8_ID (XBARB_IN_RESERVED8)
    /* @brief XBARB input 9 ID. */
    #define FSL_FEATURE_XBARB_INPUT9_ID (XBARB_IN_RESERVED9)
    /* @brief XBARB input 10 ID. */
    #define FSL_FEATURE_XBARB_INPUT10_ID (XBARB_IN_RESERVED10)
    /* @brief XBARB input 11 ID. */
    #define FSL_FEATURE_XBARB_INPUT11_ID (XBARB_IN_RESERVED11)
    /* @brief XBARB input 12 ID. */
    #define FSL_FEATURE_XBARB_INPUT12_ID (PDB0_CH0_Output)
    /* @brief XBARB input 13 ID. */
    #define FSL_FEATURE_XBARB_INPUT13_ID (ADCA_ES)
    /* @brief XBARB input 14 ID. */
    #define FSL_FEATURE_XBARB_INPUT14_ID (XBARIN2)
    /* @brief XBARB input 15 ID. */
    #define FSL_FEATURE_XBARB_INPUT15_ID (XBARIN3)
    /* @brief XBARB input 16 ID. */
    #define FSL_FEATURE_XBARB_INPUT16_ID (FTM1_match)
    /* @brief XBARB input 17 ID. */
    #define FSL_FEATURE_XBARB_INPUT17_ID (FTM1_EXTRIG)
    /* @brief XBARB input 18 ID. */
    #define FSL_FEATURE_XBARB_INPUT18_ID (DMA_CH0_done)
    /* @brief XBARB input 19 ID. */
